#+TITLE: Emacsから気象庁のデータにアクセスする

*** 東京都の週間天気予報の一つ目の時系列データを取得する

#+name: example-get-tokyo-forecast-week-ts0
#+begin_src elisp :results pp :exports both :cache yes
(jma-forecast-report-time-series-at
  (jma-forecast-week-report (jma-forecast-get "130000"))
  0)
#+end_src

#+RESULTS[6bad4b2b91a72fed4bedc01e49951f7ce07db047]: example-get-tokyo-forecast-week-ts0
#+begin_example
((timeDefines .
              ["2022-02-24T00:00:00+09:00" "2022-02-25T00:00:00+09:00" "2022-02-26T00:00:00+09:00" "2022-02-27T00:00:00+09:00" "2022-02-28T00:00:00+09:00" "2022-03-01T00:00:00+09:00" "2022-03-02T00:00:00+09:00"])
 (areas .
        [((area
           (name . "東京地方")
           (code . "130010"))
          (weatherCodes .
                        ["101" "101" "101" "201" "101" "201" "201"])
          (pops .
                ["" "10" "10" "30" "10" "30" "30"])
          (reliabilities .
                         ["" "" "A" "B" "A" "A" "A"]))
         ((area
           (name . "伊豆諸島北部")
           (code . "130020"))
          (weatherCodes .
                        ["201" "101" "101" "200" "101" "200" "201"])
          (pops .
                ["" "20" "20" "40" "10" "40" "30"])
          (reliabilities .
                         ["" "" "A" "C" "A" "C" "A"]))
         ((area
           (name . "伊豆諸島南部")
           (code . "130030"))
          (weatherCodes .
                        ["200" "101" "101" "202" "101" "200" "201"])
          (pops .
                ["" "20" "20" "50" "10" "40" "30"])
          (reliabilities .
                         ["" "" "A" "C" "A" "C" "B"]))
         ((area
           (name . "小笠原諸島")
           (code . "130040"))
          (weatherCodes .
                        ["200" "200" "101" "201" "101" "101" "101"])
          (pops .
                ["" "40" "20" "30" "20" "20" "20"])
          (reliabilities .
                         ["" "" "B" "A" "A" "A" "A"]))]))
#+end_example

結果は次の通り。

** 天気コードの情報を取得する

#+begin_src elisp :results pp :exports both :cache yes
(list
  (jma-weather-code-image-daytime 101)
  (jma-weather-code-image-night 101)
  (jma-weather-code-image 101 nil)
  (jma-weather-code-text-ja 101)
  (jma-weather-code-text-en 101))
#+end_src

#+RESULTS[928c82e78e9a1549177f163796049d380ddd8df3]:
: ("101.svg" "501.svg" "101.svg" "晴時々曇" "PARTLY CLOUDY")

** 天気コードの画像を取得する

次のコードは天気コード101に対応する画像を表示するテキストプロパティが付加された文字列を返す。

#+begin_src elisp :results pp :exports both :eval no-export
(jma-weather-code-image-string 101)
#+end_src

#+RESULTS:
: #("_" 0 1
:   (display
:    (image :type svg :file "~/.emacs.d/.jma-weather-cache/101.svg" :scale 1 :height 17 :ascent center)))

テキスト端末の場合やSVGをサポートしていない場合はnilを返す。

